# Por favor tente resolver o desafio sozinho, não pegue atalhos, tu consegue, é só colocar a cabeça para funcionar.

Execute a célula abaixo apenas uma vez.

In [1]:
%%bash

rm -rf /tmp/github; mkdir -p /tmp/github; cd /tmp/github
git clone https://github.com/romeritomorais/30-day-challenges-with-sql.git
sh /tmp/github/30-day-challenges-with-sql/challenges/utils/install-miniconda.sh > /dev/null 2>&1
sh /tmp/github/30-day-challenges-with-sql/challenges/utils/update-miniconda.sh > /dev/null 2>&1

Cloning into '30-day-challenges-with-sql'...

Nesse desafio eu preciso da idade das pessoas da tabela `Employee` use a coluna BithDate para a transformação.

Critério:  
que voce escreva essa transformação em apenas uma query. Boa sorte.


resultado esperado:  

|LastName|ano_de_nascimento|idade
|--------:|----------------:|-----
|Adams   |1962             |   60
|Edwards |1958             |   64
|Peacock |1973             |   49
|Park    |1947             |   75
|Johnson |1965             |   57
|Mitchell|1973             |   49
|King    |1970             |   52
|Callahan|1968             |   54

Na celula onde tem `%%sql` tu vai escrever a query abaixo dela, exemplo:  
```python
%%sql
select * from Customer
```

Para resolução tu podes usar a documentação do sqlite:https://www.sqlite.org/docs.html

In [2]:
%load_ext sql
%sql sqlite://///tmp/github/30-day-challenges-with-sql/challenges/utils/db/database.db

'Connected: @//tmp/github/30-day-challenges-with-sql/challenges/utils/db/database.db'

In [23]:
%%sql
select 
  LastName, 
  strftime('%Y', BirthDate) as ano_de_nascimento,
  date('now') - BirthDate as idade
from Employee

 * sqlite://///tmp/github/30-day-challenges-with-sql/challenges/utils/db/database.db
Done.

[('Adams', '1962', 60),
 ('Edwards', '1958', 64),
 ('Peacock', '1973', 49),
 ('Park', '1947', 75),
 ('Johnson', '1965', 57),
 ('Mitchell', '1973', 49),
 ('King', '1970', 52),
 ('Callahan', '1968', 54)]